## 1. Write a Pandas program to get the powers of an array values element-wise.
### SOLUTION :

In [16]:
import pandas as pd
import numpy as np
d = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
d_f = pd.DataFrame(d)
print(d_f)
print(np.power(d_f,2))

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83
      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

## 2. Write a Pandas program to create and display a DataFrame from a specified dictionary            data which has the index labels.
### SOLUTION :

In [2]:
import pandas as pd
import numpy as np
exam_data = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
            'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},
            index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(exam_data)
exam_data = exam_data[['attempts','name','qualify','score']]
print('\n',exam_data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

    attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

## 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
### SOLUTION :

In [40]:
exam_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

## 4. Write a Pandas program to get the first 3 rows of a given DataFrame.
### SOLUTION :

In [41]:
exam_data.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

## 5. Write a Pandas program to select the 'name' and 'score' columns from the following                DataFrame.
### SOLUTION :

In [12]:
exam_data[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

## 6. Write a Pandas program to select the specified columns and rows from a given data.
### SOLUTION :

In [42]:
exam_data.iloc[[1,3,5,6],[1,3]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

## 7. Write a Pandas program to select the rows where the number of attempts in the                        examination is greater than 2.
### SOLUTION :

In [17]:
exam_data[exam_data['attempts']>2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

## 8. Write a Pandas program to count the number of rows and columns of a DataFrame.
### SoLUTION :

In [43]:
print("Number of Rows : ",len(exam_data.axes[0]))
print("Number of Columns : ",len(exam_data.axes[1]))

Number of Rows :  10
Number of Columns :  4

## 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.
### SOLUTION :

In [21]:
exam_data[exam_data['score'].isnull()]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

## 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
### SOLUTION :

In [44]:
exam_data[exam_data['score'].between(15,20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

## 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
### SOLUTION :

In [45]:
exam_data[(exam_data['attempts']<=2) & (exam_data['score']>15)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0

## 12. Write a Pandas program to change the score in row 'd' to 11.5.
### SOLUTION :

In [46]:
exam_data.loc['d','score']= 11.5
exam_data

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

## 13. Write a Pandas program to calculate the sum of the examination attempts by the students.
### SOLUTION :

In [31]:
exam_data['attempts'].sum()

19

## 14. Write a Pandas program to calculate the mean score for each different student in DataFrame. Sample Python dictionary data and list labels:
### SOLUTION :

In [32]:
exam_data['score'].mean()

13.333333333333334

## 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.
### SOLUTION :

In [47]:
import pandas as pd
exam_data.loc['k'] = [1,'Suresh','yes',15.5]
print(exam_data,'\n')
exam_data.drop('k')

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0
k         1     Suresh     yes   15.5

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

##  16. Write a Pandas program to sort the DataFrame first by 'name' in descending order,   then by 'score' in ascending order.
### SOLUTION :

In [48]:
exam_data.sort_values(by=['name', 'score'], ascending=[False, True])

   attempts       name qualify  score
k         1     Suresh     yes   15.5
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0
d         3      James      no   11.5
e         2      Emily      no    9.0
b         3       Dima      no    9.0
a         1  Anastasia     yes   12.5

## 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.
### SOLUTION :

In [61]:
exam_data['qualify'] = exam_data['qualify'].replace(['yes','no'],['True','False'])
exam_data

   attempts       name qualify  score
a         1  Anastasia    True   12.5
b         3       Dima   False    9.0
c         2  Katherine    True   16.5
d         3     Suresh   False    NaN
e         2      Emily   False    9.0
f         3    Michael    True   20.0
g         1    Matthew    True   14.5
h         1      Laura   False    NaN
i         2      Kevin   False    8.0
j         1      Jonas    True   19.0

## 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.
### SOLUTION :

In [62]:
exam_data['qualify'] = exam_data['qualify'].replace(['True','False'],['yes','no'])
exam_data['name'] = exam_data['name'].replace('James', 'Suresh')
exam_data

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3     Suresh      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

## 19. Write a Pandas program to delete the 'attempts' column from the DataFrame.
### SOLUTION :

In [66]:
try :
    exam_data.pop('attempts')
except :
    pass
print(exam_data)

        name qualify  score
a  Anastasia     yes   12.5
b       Dima      no    9.0
c  Katherine     yes   16.5
d     Suresh      no    NaN
e      Emily      no    9.0
f    Michael     yes   20.0
g    Matthew     yes   14.5
h      Laura      no    NaN
i      Kevin      no    8.0
j      Jonas     yes   19.0

## 20. Write a Pandas program to insert a new column in existing DataFrame.
### SOLUTION :

In [74]:
exam_data = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
            'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},
            index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
exam_data['color'] = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
print(exam_data)
try :
    exam_data.pop('color')
except :
    pass

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

## 21. Write a Pandas program to iterate over rows in a DataFrame.
### SOLUTION :

In [80]:
for index,row in exam_data.iterrows() :
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

## 22. Write a Pandas program to get list from DataFrame column headers.
### SOLUTION :

In [82]:
list(exam_data.columns.values)

['name', 'score', 'attempts', 'qualify']

## 23. Write a Pandas program to rename columns of a given DataFrame.
### SOLUTION :

In [7]:
num_data = pd.DataFrame({'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]})
print(num_data,'\n')
num_data.columns = ['Column1','Column2','Column3']
print(num_data)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

## 24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.
    NOTE : Rows for colum1 value == 4
### SOLUTION :

In [17]:
num_data = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})
num_data.loc[num_data['col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

## 25. Write a Pandas program to change the order of a DataFrame columns.
### SOLUTION :

In [18]:
num_data[['col3','col2','col1']]

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

## 26. Write a Pandas program to add one row in an existing DataFrame.
### SOLUTION :

In [8]:
new_data = {'col1': 10, 'col2': 11, 'col3': 12}
num_data.append(new_data, ignore_index=True)

   Column1  Column2  Column3  col1  col2  col3
0      1.0      4.0      7.0   NaN   NaN   NaN
1      2.0      5.0      8.0   NaN   NaN   NaN
2      3.0      6.0      9.0   NaN   NaN   NaN
3      NaN      NaN      NaN  10.0  11.0  12.0

## 27. Write a Pandas program to write a DataFrame to CSV file using tab separator.
### SOLUTION :

In [12]:
print(num_data,'\n')
num_data.to_csv('dataframe_file.csv', sep='\t', index=False)
print(pd.read_csv('dataframe_file.csv'))

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1

## 28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).
### SOLUTION :

In [92]:
counter_data = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
                'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 
                         'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
counter_data.groupby(["city"]).size().reset_index(name='Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

## 29. Write a Pandas program to delete DataFrame row(s) based on given column value.
### SOLUTION :

In [94]:
num_data.drop(1)

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

## 30. Write a Pandas program to widen output display to see more columns.
### SOLUTION :

In [11]:
print(pd.set_option('display.max_rows', 500))
pd.set_option('display.max_columns', 500)
pd.set_option('display.width'
              , 1000)
num_data

None

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

## 31. Write a Pandas program to select a row of series/dataframe by given integer index.
### SOLUTION :

In [15]:
num_data.iloc[[2]]

   col1  col2  col3
2     3     6     9

## 32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.
### SOLUTION :

In [20]:
print(exam_data,'\n')
exam_data.fillna(0)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    0.0
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    0.0
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

## 33. Write a Pandas program to convert index in a column of the given dataframe.
### SOLUTION :

In [62]:
try :
    exam_data['index'] = exam_data.index
except :
    pass

print(exam_data)
print("Hide Index")
print(exam_data.to_string(index=False))

try :
    exam_data.pop('index')
except :
    pass
exam_data

   attempts       name qualify  score  index
0         1  Anastasia     yes   12.5      0
1         3       Dima      no    9.0      1
2         2  Katherine     yes   16.5      2
3         3      James      no    NaN      3
4         2      Emily      no    9.0      4
5         3    Michael     yes   20.0      5
6         1    Matthew     yes   14.5      6
7         1      Laura      no    NaN      7
8         2      Kevin      no    8.0      8
9         1      Jonas     yes   19.0      9
Hide Index
 attempts       name qualify  score  index
        1  Anastasia     yes   12.5      0
        3       Dima      no    9.0      1
        2  Katherine     yes   16.5      2
        3      James      no    NaN      3
        2      Emily      no    9.0      4
        3    Michael     yes   20.0      5
        1    Matthew     yes   14.5      6
        1      Laura      no    NaN      7
        2      Kevin      no    8.0      8
        1      Jonas     yes   19.0      9

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
3         3      James      no    NaN
4         2      Emily      no    9.0
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    NaN
8         2      Kevin      no    8.0
9         1      Jonas     yes   19.0

## 34. Write a Pandas program to set a given value for particular cell in DataFrame using index value.
### SOLUTION :

In [67]:
exam_data.at[8, 'score'] = 10.2
exam_data

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
3         3      James      no    NaN
4         2      Emily      no    9.0
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    NaN
8         2      Kevin      no   20.0
9         1      Jonas     yes   19.0

## 35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.
### SOLUTION :

In [71]:
print(f"SUM ofNAN values : {exam_data.isnull().values.sum()}")

SUM ofNAN values : 2

## 36. Write a Pandas program to drop a list of rows from a specified DataFrame.
### SOLUTION :

In [74]:
print("2nd and 4th rows are removeing : ")
exam_data.drop([2,4])

2nd and 4th rows are removeing :

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
3         3      James      no    NaN
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    NaN
8         2      Kevin      no   20.0
9         1      Jonas     yes   19.0

## 37. Write a Pandas program to reset index in a given DataFrame.
### SOLUTION :

In [77]:
print('ORignal Data: \n')
print(exam_data)
print("\n\n 2nd and 4th rows are removeing : \n")
df = exam_data.drop([2,4])
print(df)
print("\n\n Reindexing :\n")
print(df.reset_index())

ORignal Data:

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
3         3      James      no    NaN
4         2      Emily      no    9.0
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    NaN
8         2      Kevin      no   20.0
9         1      Jonas     yes   19.0


 2nd and 4th rows are removeing :

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
3         3      James      no    NaN
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    NaN
8         2      Kevin      no   20.0
9         1      Jonas     yes   19.0


 Reindexing :

   index  attempts       name qualify  score
0      0         1  Anastasia     yes   12.5
1      1         3       Dima      no    9.0
2      3         3      James      no    NaN
3      5         3    Michael     yes   20.0
4      6         1    Matthew     yes   14.5
5      7         1      Laura      no    NaN
6      8         2      Kevin      no   20.0
7      9         1      Jonas     yes   19.0

## 38. Write a Pandas program to devide a DataFrame in a given ratio.
### SOLUTION :

In [82]:
random_data = pd.DataFrame(np.random.randn(10, 2))
print(f"Data base : \n{random_data}")
first_divide =random_data.sample(frac=0.7,random_state=10)
print(f'\nDivide database in portion of 70 per cent : \n{first_divide}')
print(f'\nDivide database in portion of 30 per cent : \n{random_data.drop(first_divide.index)}')

Data base :
          0         1
0 -0.655790 -1.039428
1 -0.230239  0.261844
2 -0.485857 -0.658166
3  0.692303 -0.406555
4 -1.820215 -1.398742
5 -0.006662 -0.223681
6  0.372445  1.432714
7  0.477815  0.320086
8  0.797222  1.351610
9 -0.256533  1.006606

Divide database in portion of 70 per cent :
          0         1
8  0.797222  1.351610
2 -0.485857 -0.658166
5 -0.006662 -0.223681
6  0.372445  1.432714
3  0.692303 -0.406555
1 -0.230239  0.261844
0 -0.655790 -1.039428

Divide database in portion of 30 per cent :
          0         1
4 -1.820215 -1.398742
7  0.477815  0.320086
9 -0.256533  1.006606

## 39. Write a Pandas program to combining two series into a DataFrame.
### SOLUTION :

In [85]:
fs = pd.Series(['100', '200', 'python', '300.12', '400'])
ss = pd.Series(['10', '20', 'php', '30.12', '40']) 
pd.concat([fs, ss], axis=1)

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

## 40. Write a Pandas program to shuffle a given DataFrame rows.
### SOLUTION :

In [86]:
exam_data.sample(frac = 1)

   attempts       name qualify  score
5         3    Michael     yes   20.0
1         3       Dima      no    9.0
8         2      Kevin      no   20.0
7         1      Laura      no    NaN
3         3      James      no    NaN
2         2  Katherine     yes   16.5
9         1      Jonas     yes   19.0
0         1  Anastasia     yes   12.5
4         2      Emily      no    9.0
6         1    Matthew     yes   14.5

## 41. Write a Pandas program to convert DataFrame column type from string to datetime.
### SOLUTION :

In [98]:
dates = ['3/11/2000', '3/12/2000', '3/13/2000']
cd =pd.DataFrame(dates)
print(f'Orignal DataFrame : \n{cd}')
dt = pd.to_datetime(dates)
nd = pd.DataFrame(dt)
print(f'\n\nDateTime DataFrame : \n{nd}')

Orignal DataFrame :
           0
0  3/11/2000
1  3/12/2000
2  3/13/2000


DateTime DataFrame :
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

## 42. Write a Pandas program to rename a specific column name in a given DataFrame.
### SOLUTION :

In [102]:
num_data.rename(columns = {'col2':'Column2'})

   col1  Column2  col3
0     1        4     7
1     4        5     8
2     3        6     9
3     4        7     0
4     5        8     1

## 43. Write a Pandas program to get a list of a specified column of a DataFrame.
### SOLUTION :

In [103]:
num_data['col2'].tolist()

[4, 5, 6, 7, 8]

## 44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.
### SOLUTION :

In [106]:
dt = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values = np.zeros(15, dtype=dt)
indexing = ['Index'+str(i) for i in range(1, len(values)+1)]
pd.DataFrame(values, index=indexing)

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

## 45. Write a Pandas program to find the row for where the value of a given column is maximum.
### SOLUTION :

In [110]:
print(f"Data Base :\n {num_data}")
print('Row where col1 has maximum value: ',num_data['col1'].argmax())
print('\nRow where col2 has maximum value: ',num_data['col2'].argmax())
print('\nRow where col3 has maximum value: ',num_data['col3'].argmax())

Data Base :
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Row where col1 has maximum value:  4

Row where col2 has maximum value:  4

Row where col3 has maximum value:  2

/home/animesh/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.

/home/animesh/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  This is separate from the ipykernel package so we can avoid doing imports until
/home/animesh/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  after removing the cwd from sys.path.

## 46. Write a Pandas program to check whether a given column is present in a DataFrame or not.
### SOLUTION

In [12]:
cn = input("Enter your column number : ")
column_number = ("col"+cn)
if column_number in num_data.columns:
    print(f"{column_number} is present in DataFrame.")
else :
    print(f"{column_number} is not present in DataFrame.")

Enter your column number : 5
col5 is not present in DataFrame.

## 47. Write a Pandas program to get the specified row value of a given DataFrame.
### SOLUTION :

In [15]:
row_number = int(input("Enter your column number : "))
rn = row_number-1
print(num_data)
print(f'\n Value of row{rn}\n')
print(num_data.iloc[rn])

Enter your column number : 3
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

 Value of row2

Column1    3
Column2    6
Column3    9
Name: 2, dtype: int64

## 48. Write a Pandas program to get the datatypes of columns of a DataFrame.
### SOLUTION :

In [19]:
num_data.dtypes

col1    int64
col2    int64
col3    int64
dtype: object

## 49. Write a Pandas program to append data to an empty DataFrame.
### SOLUTION :

In [21]:
ed = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
ed.append(data)

   col1  col2
0     0     0
1     1     1
2     2     2

## 50. Write a Pandas program to sort a given DataFrame by two or more columns.
### SOLUTION :

In [22]:
print('orignal DataFrame : \n',exam_data)
print('\n sorted Data : \n')
exam_data.sort_values(['attempts', 'name'], ascending=[True, True])

orignal DataFrame :
    attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

 sorted Data :

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
j         1      Jonas     yes   19.0
h         1      Laura      no    NaN
g         1    Matthew     yes   14.5
e         2      Emily      no    9.0
c         2  Katherine     yes   16.5
i         2      Kevin      no    8.0
b         3       Dima      no    9.0
d         3      James      no    NaN
f         3    Michael     yes   20.0

## 51. Write a Pandas program to convert the datatype of a given column (floats to ints).
### SOLUTION :

In [30]:
exam_data1 = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df1 = pd.DataFrame(exam_data1)

print("BEFORE type casting :\n")
print(df1)
print(df1.dtypes)
print("\nAFTER tyoe casting :\n")
df1.score = df1.score.astype(int)
print(df1)
print(df1.dtypes)

BEFORE type casting :

        name  score  attempts qualify
0  Anastasia  12.50         1     yes
1       Dima   9.10         3      no
2  Katherine  16.50         2     yes
3      James  12.77         3      no
4      Emily   9.21         2      no
5    Michael  20.22         3     yes
6    Matthew  14.50         1     yes
7      Laura  11.34         1      no
8      Kevin   8.80         2      no
9      Jonas  19.13         1     yes
name         object
score       float64
attempts      int64
qualify      object
dtype: object

AFTER tyoe casting :

        name  score  attempts qualify
0  Anastasia     12         1     yes
1       Dima      9         3      no
2  Katherine     16         2     yes
3      James     12         3      no
4      Emily      9         2      no
5    Michael     20         3     yes
6    Matthew     14         1     yes
7      Laura     11         1      no
8      Kevin      8         2      no
9      Jonas     19         1     yes
name        object
score        int64
attempts     int64
qualify     object
dtype: object

## 52. Write a Pandas program to remove infinite values from a given DataFrame.
### SOLUTION :

In [31]:
od = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Orignal DataBase : ")
print(od)

print("\nNew DataBase : ")
od.replace([np.inf, -np.inf], np.nan)

Orignal DataBase :
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

New DataBase :

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

## 53. Write a Pandas program to insert a given column at a specific column index in a DataFrame.
### SOLUTION :

In [34]:
od = pd.DataFrame({'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
print("Orignal Data Base : ")
print(od)
od.insert(loc=0, column='col1', value=[1, 2, 3, 4, 7])
print("\nInsert Column : ")
od

Orignal Data Base :
   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

Insert Column :

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

## 54. Write a Pandas program to convert a given list of lists into a Dataframe.
### SOLUTION :

In [35]:
gl = [[2, 4], [1, 3]]
pd.DataFrame(gl, columns =['col1', 'col2'])

   col1  col2
0     2     4
1     1     3

## 55. Write a Pandas program to group by the first column and get second column as lists in rows.
### SOLUTION :

In [36]:
data = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Orignal DataFrame")
print(data)
print('\n Grouping of first and second columns : ')
data.groupby('col1')['col2'].apply(list)

Orignal DataFrame
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

 Grouping of first and second columns :

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

## 56. Write a Pandas program to get column index from column name of a given DataFrame.
### SOLUTION :

In [41]:
new_data = pd.DataFrame({'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]})
print("Data Frame : \n",new_data)
a = input("Enter Your Column number : ")
col_num = 'col'+a
print(f"Index Number of col{a} is {new_data.columns.get_loc(col_num)}")

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Enter Your Column number : 2
Index Number of col2 is 1

## 57. Write a Pandas program to count number of columns of a DataFrame.
### SOLUTION :

In [42]:
print("Data Frame : \n",new_data)
print(f"\n Total number of columns is {len(new_data.columns)}")

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

 Total number of columns is 3

## 58. Write a Pandas program to select all columns, except one given column in a DataFrame.
### SOLUTION :

In [44]:
print("Data Frame : \n",new_data)
print("\nAll columns except 'col3':")
new_data.loc[:, new_data.columns != 'col3']

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

All columns except 'col3':

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

## 59. Write a Pandas program to get first n records of a DataFrame.
### SOLUTION :

In [45]:
print("Data Frame : \n",new_data)
print("\nFirst 3 rows of the said DataFrame':")
new_data.head(3)

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

First 3 rows of the said DataFrame':

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

## 60. Write a Pandas program to get last n records of a DataFrame.
### SOLUTION :

In [46]:
print("Data Frame : \n",new_data)
print("\nLast 3 rows of the said DataFrame':")
new_data.tail(3)

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Last 3 rows of the said DataFrame':

   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5    11

## 61. Write a Pandas program to get topmost n records within each group of a DataFrame.
### SOLUTION :

In [52]:
print("Data Frame : \n",new_data)
print("\nFirst Column's Topmost Record: \n", new_data.nlargest(3, 'col1'))
print("\nSecond Column's Topmost Record: \n", new_data.nlargest(3, 'col2'))
print("\nThird Column's Topmost Record: \n", new_data.nlargest(3, 'col3'))

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

First Column's Topmost Record:
    col1  col2  col3
4     7     5    11
3     4     9     1
2     3     6    12

Second Column's Topmost Record:
    col1  col2  col3
3     4     9     1
2     3     6    12
1     2     5     8

Third Column's Topmost Record:
    col1  col2  col3
2     3     6    12
4     7     5    11
1     2     5     8

## 62. Write a Pandas program to remove first n rows of a given DataFrame.
### SOLUTION :

In [53]:
print("Data Frame : \n",new_data)
print("\nAfter removing first 2 rows of the said DataFrame:")
print(new_data.iloc[2:])

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

After removing first 2 rows of the said DataFrame:
   col1  col2  col3
2     3     6    12
3     4     9     1
4     7     5    11

## 63. Write a Pandas program to remove last n rows of a given DataFrame.
### SOLUTION :

In [57]:
print("Data Frame : \n",new_data)
print("\nAfter removing last 2 rows of the said DataFrame:")
print(new_data.iloc[:3])

Data Frame :
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

After removing last 2 rows of the said DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12